{
   "init": false,
   "smileyList": {
      "eyes": [":", "X", ";", "=", "8"],
      "mouth": [")", "]", "D", "3", "p", "b", "þ"]
   },
   "error": {
      "title": {
         "en": ["Page not found", "Error 404"],
         "fr": ["Page introuvable", "Erreurs 404"]
      }
   },
   "home": {
      "title": {
         "en": ["my name is", "and i'm a", "Front-End Developer"],
         "fr": ["je m'appelle", "et je suis", "Développeur Front-End"]
      },
      "skills": [
         { "name": "js", "type": "color" },
         { "name": "ts", "type": "color" },
         { "name": "tailwind", "type": "color" },
         { "name": "react", "type": "color" },
         { "name": "redux", "type": "color" },
         { "name": "npm", "type": "color" },
         { "name": "vitejs", "type": "color" },
         { "name": "nextjs", "type": "bw" }
      ]
   },
   "work": {
      "title": {
         "en": "Work",
         "fr": "Projets"
      },
      "tag": {
         "personnal": "Personnal",
         "school": "School"
      },
      "projects": {
         "portfolio_2024": {
            "id": "portfolio_2024",
            "date": "12/02/2024",
            "name": "Portfolio 2024",
            "category": "personnal",
            "description": {
               "en": "The first design in my portfolio, created in 2024 after I finished my learning. ",
               "fr": "Le premier design de mon portfolio réalisé en 2024 après la fin de ma formation."
            },
            "tag": ["ts", "react", "redux", "mobile", "desktop", "personnal"],
            "github": "https://github.com/kharoncode/rc_portfolio",
            "link": "https://www.collinremi.com"
         },
         "hrnet": {
            "id": "hrnet",
            "date": "12/01/2024",
            "name": "HRnet",
            "category": "school",
            "description": {
               "en": "HRnet is an application that manages employee files.",
               "fr": "HRnet est une application qui gère les dossiers des employés."
            },
            "tag": ["ts", "react", "redux", "npm", "desktop", "school"],
            "github": "https://github.com/kharoncode/OC-P14-HRNet",
            "link": ""
         },
         "buffTimer": {
            "id": "buffTimer",
            "date": "20/12/2023",
            "name": "BuffTimer",
            "category": "personnal",
            "description": {
               "en": "An application for a Role Playing Game allowing players to share their character's health status, active Buffs and indicate their needs.",
               "fr": "Une application pour un Jeu de Rôle permettant aux joueurs de partager l'état de santé de leur personnage, les Buff actif et d'indiquer leurs besoins."
            },
            "tag": ["ts", "react", "redux", "mobile", "desktop", "personnal"],
            "github": "https://github.com/kharoncode/BuffTimer",
            "link": "https://www.collinremi.com/website/bufftimer"
         },
         "argent_bank": {
            "id": "argent_bank",
            "date": "11/12/2024",
            "name": "Argent Bank",
            "category": "school",
            "description": {
               "en": "An authentication page for a banking application.",
               "fr": "Une page d'authentification d'une application bancaire."
            },
            "tag": ["js", "react", "redux", "desktop", "school"],
            "github": "https://github.com/kharoncode/OC-P13",
            "link": ""
         },
         "sportsee": {
            "id": "sportsee",
            "date": "30/10/2023",
            "name": "SportSee",
            "category": "school",
            "description": {
               "en": "An analytical dashboard for a sports application.",
               "fr": "Un tableau de bord analytique pour une application sportive."
            },
            "tag": ["js", "react", "desktop", "school"],
            "github": "https://github.com/kharoncode/OC-P12",
            "link": ""
         },
         "kaza": {
            "id": "kaza",
            "date": "25/10/2023",
            "name": "Kaza",
            "category": "school",
            "description": {
               "en": "Website for renting flats between private individuals.",
               "fr": "Site de mise en location d’appartements entre particuliers."
            },
            "tag": ["js", "react", "desktop", "mobile", "school"],
            "github": "https://github.com/kharoncode/OC-P11",
            "link": ""
         },
         "les_petits_plats": {
            "id": "les_petits_plats",
            "date": "05/06/2023",
            "name": "Les petits plats",
            "category": "school",
            "description": {
               "en": "Cooking recipes website with the option of sorting your search by tags or using the search field.",
               "fr": "Site de recettes de cuisine avec possibilité de trier sa recherche par tags ou avec le champ de recherche."
            },
            "tag": ["js", "desktop", "mobile", "school"],
            "github": "https://github.com/kharoncode/OC-P7",
            "link": "https://kharoncode.github.io/OC-P7"
         },
         "fisheye": {
            "id": "fisheye",
            "date": "11/04/2023",
            "name": "Fisheye",
            "category": "school",
            "description": {
               "en": "FishEye is an accessible website that allows freelance photographers to showcase their work.",
               "fr": "FishEye est un site web accessible qui permet aux photographes indépendants de présenter leurs travaux."
            },
            "tag": ["js", "desktop", "mobile", "school"],
            "github": "https://github.com/kharoncode/Front-End-Fisheye",
            "link": "https://kharoncode.github.io/Front-End-Fisheye/"
         }
      }
   },
   "about": {
      "title": {
         "en": "About",
         "fr": "A propos"
      },
      "content": {
         "en": [
            "Hi there and welcome to my den, allow me to introduce myself...",
            "My name is Rémi and I’m what you could call a passionate developer. Possessed with a brimming imagination, my journey began at the Beaux Arts, in Geneva, Switzerland, where I discovered the many ways in which art allowed creative minds like mine to lend form to the crazy ideas they give birth to. It also allowed me to develop a taste for the constant pursuit and challenge of turning abstract projects into tangible and realities.",
            "Years after leaving the Beaux Arts, this taste found it’s true expression when I entered the mesmerizing world of coding… switching paint brushes and crayons for lines of codes allowed my thirst for challenge to meet with my hankering for finding and applying innovative solutions to all sorts of problems and challenges.",
            "I hope you'll enjoy the projects I've selected so far and made available for your perusing here.",
            "Please don't hesitate to let me know what you think or even to submit any crazy ideas you think will fuel my creativity."
         ],
         "fr": [
            "Bonjour et bienvenue dans mon antre, permettez-moi de me présenter...",
            "Je m'appelle Rémi et je suis ce que l'on pourrait appeler un développeur passionné. Doté d'une imagination débordante, mon parcours a commencé aux Beaux-Arts de Genève, en Suisse, où j'ai découvert les multiples façons dont l'art permettait aux esprits créatifs comme le mien de donner forme aux idées folles qu'ils faisaient naître. Cela m'a également permis de développer un goût pour la poursuite constante de défi afin de transformer des projets abstraits en réalités tangibles.",
            "Des années après avoir quitté les Beaux-Arts, ce goût a trouvé sa véritable expression lorsque je suis entré dans le monde envoûtant du codage... troquer les pinceaux et les crayons contre des lignes de code a permis à ma soif de défi de rencontrer mon envie de trouver et d'appliquer des solutions innovantes à toutes sortes de problèmes et de défis.",
            "J'espère que vous apprécierez les projets que j'ai créés jusqu'à présent et que vous pouvez consulter ici.",
            "N'hésitez pas à me dire ce que vous en pensez ou même à me soumettre des idées farfelues qui, selon vous, alimenteront ma créativité."
         ]
      }
   },
   "contact": {
      "content": {
         "en": [
            "Feel free to Contact me by submitting the form below and I will get back to you as soon as possible."
         ],
         "fr": [
            "N'hésitez pas à me contacter en remplissant le formulaire ci-dessous et je vous répondrai dans les plus brefs délais."
         ]
      },
      "input": {
         "name": {
            "en": "Name",
            "fr": "Nom"
         }
      },
      "modal": {
         "en": "Your message has been sent. Thank you very much!",
         "fr": "Votre message m'a bien été envoyé. Merci !"
      },
      "waiting_room": {
         "title": {
            "en": [
               "Would you like to send me another message? Take ",
               " to share something together :"
            ],
            "fr": [
               "Vous souhaitez déjà me renvoyer un autre message ? Prenons ",
               " pour lire quelques citations :"
            ]
         },
         "content": {
            "en": [
               {
                  "author": "Bill Gates",
                  "quote": "Measuring programming progress by lines of code is like measuring aircraft building progress by weight."
               },
               {
                  "author": "Jeff Atwood",
                  "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live."
               },
               {
                  "author": "Hal Abelson",
                  "quote": "Programs must be written for people to read, and only incidentally for machines to execute."
               },
               {
                  "author": "Philip Lewis Karlton",
                  "quote": "There are only two hard things in Computer Science: cache invalidation and naming things."
               },
               {
                  "author": "Rick Cook",
                  "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning."
               },
               {
                  "author": "Marc Andreessen",
                  "quote": "The spread of computers and the Internet will put jobs in two categories. People who tell computers what to do, and people who are told by computers what to do."
               }
            ],
            "fr": [
               {
                  "author": "Bill Gates",
                  "quote": "Mesurer les progrès de la programmation en lignes de code, c'est comme mesurer les progrès de la construction d'un avion en poids."
               },
               {
                  "author": "Jeff Atwood",
                  "quote": "Codez toujours comme si le gars qui finira par maintenir votre code sera un psychopathe violent qui sait où vous vivez."
               },
               {
                  "author": "Hal Abelson",
                  "quote": "Les programmes doivent être écrits pour que les gens les lisent, et seulement accessoirement pour que les machines les exécutent."
               },
               {
                  "author": "Philip Lewis Karlton",
                  "quote": "Il n'y a que deux choses difficile dans les sciences de l'informatique, supprimer le cache et nommer les choses."
               },
               {
                  "author": "Rick Cook",
                  "quote": "Aujourd'hui, la programmation est une course entre les ingénieurs en logiciel qui s'efforcent de construire des programmes de plus en plus grands et de mieux en mieux protégés contre les idiots, et l'univers qui essaie de produire toujours plus d'idiots. Jusqu'à présent, c'est l'univers qui gagne."
               },
               {
                  "author": "Marc Andreessen",
                  "quote": "La généralisation des ordinateurs et de l'Internet va diviser les emplois en deux catégories. Les personnes qui disent aux ordinateurs ce qu'ils doivent faire et les personnes à qui les ordinateurs disent ce qu'ils doivent faire."
               }
            ]
         }
      }
   }
}
